{
  "artists": [
    {
      "id": 1,
      "name": "Pink Floyd",
      "country": "UK",
      "photo": "https://i.imgur.com/3ZbNxSY.jpeg",
      "description": "Opis Pink Floyd"
    },
    {
      "id": 3,
      "name": "Metallica",
      "country": "USA",
      "photo": "https://i.scdn.co/image/ab6761610000e5eb8101d13bdd630b0889acd2fd",
      "description": "Metallica is an American heavy metal band. The band was formed in 1981 in San Francisco by vocalist/guitarist James Hetfield and drummer Lars Ulrich and has been based in San Francisco for most of its career. The band's fast tempos, instrumentals, and aggressive musicianship made them one of the founding \"big four\" bands of thrash metal, alongside Megadeth, Anthrax, and Slayer. Metallica's current lineup comprises founding members, primary songwriters Hetfield, Ulrich, longtime lead guitarist Kirk Hammett, and bassist Robert Trujillo. Read more on Last.fm"
    },
    {
      "id": 4,
      "name": "Lady Pank",
      "country": "Polska",
      "photo": "https://i.scdn.co/image/ab6761610000e5eb7060f24ff88671d0cd59e953",
      "description": "Lady Pank is a popular Polish rock band. It was started in 1982 in Warsaw by Jan Borysewicz and Andrzej Mogielnicki. Its first famous song was \"Mała Lady Punk\" (Little Lady Punk). Lady Pank garnered some attention in the United States in 1986 when MTV placed the video for the band's single \"Minus Zero\" on heavy rotation.\n\nLady Pank is quite a curiosity on the Polish musical market. They got popular before they were actually... formed! The group, which was originally planning to call itself \"Żużel\" Read more on Last.fm"
    },
    {
      "id": 5,
      "name": "Paktofonika",
      "country": "Polska",
      "photo": "https://i.scdn.co/image/1cc93197c2ce026294ad15ee5df2a0fefb5eb488",
      "description": "Paktofonika was a Polish hip-hop group from Katowice and Mikołów that formed in 1998. They debuted with the album Kinematografia in 2000. \n\nPaktofonika was founded shortly after Magik left Kaliber 44 during the recording of their second album, W 63 minuty dookoła świata. Rahim left his group 3xKlan at around the same time, and formed Paktofonika with Magik and Fokus in 1998.\n\nIn the spring of 2000 the group were signed with Gigant Records. That same year, on December 18, they released their debut album Kinematografia. Read more on Last.fm"
    },
    {
      "id": 6,
      "name": "Megadeth",
      "country": "USA",
      "photo": "https://i.scdn.co/image/ab6761610000e5ebace132cb20a3fd6725d5e27d",
      "description": "Megadeth is an American heavy metal band formed in Los Angeles in 1983 by vocalist/guitarist Dave Mustaine and bassist David Ellefson. Known for their technically complex guitar work and musicianship, Megadeth is one of the \"big four\" of American thrash metal along with Metallica, Anthrax, and Slayer, responsible for the genre's development and popularization. Their music features complex arrangements and fast rhythm sections, and lyrical themes of death, war, politics, personal relationships, and religion. Read more on Last.fm"
    },
    {
      "id": 7,
      "name": "Kanye West",
      "country": "USA",
      "photo": "https://i.scdn.co/image/ab6761610000e5eb867008a971fae0f4d913f63a",
      "description": "Ye (born Kanye Omari West on June 8, 1977 in Atlanta, Georgia), professionally known as Kanye West, is a Grammy award-winning American rapper, producer, singer, author, and fashion designer.\n\nWest began making beats and rapping in the early 90s in his hometown of Chicago, Illinois, when he formed the rap group Go Getters with Chicago natives GLC and Really Doe. He later gained nationwide popularity through his work in New York, where he began producing tracks for artists such as Jay-Z, Twista, Mase, Talib Kweli and Alicia Keys. Read more on Last.fm"
    },
    {
      "id": 8,
      "name": "The Beatles",
      "country": "UK",
      "photo": "https://i.scdn.co/image/ab6761610000e5ebe9348cc01ff5d55971b22433",
      "description": "The Beatles were an English  pop rock and beat band formed in Liverpool in 1960. With the line-up comprising of John Lennon, Paul McCartney, George Harrison and Ringo Starr, they are regarded as one of the most influential bands of all time. The group was integral to the development of 1960s counterculture and popular music's recognition as an art form. Rooted in skiffle, beat and 1950s rock and roll, their sound incorporated elements of classical Read more on Last.fm"
    },
    {
      "id": 9,
      "name": "Łona i Webber",
      "country": "Polska",
      "photo": "https://i.scdn.co/image/ab6761610000e5eb43cd36b742e66d63b1137ddd",
      "description": " Read more on Last.fm"
    }
  ],
  "genres": [
    {
      "id": 1,
      "name": "Rock"
    },
    {
      "id": 2,
      "name": "Pop"
    }
  ],
  "albums": [
    {
      "id": 1,
      "name": "The Dark Side of The Moon",
      "artistId": 1,
      "genre": "Prog Rock",
      "yearOfRelease": 1973,
      "tracks": 9,
      "description": "Opis albumu DSOTM",
      "cover": "https://i.imgur.com/C4wTw2b.jpg"
    },
    {
      "id": 2,
      "name": "Wish You Were Here",
      "artistId": 1,
      "genre": "Prog Rock",
      "yearOfRelease": "1975",
      "tracks": 5,
      "description": "The band entered Abbey Road Studios during the first week of 1975 to begin recording on their follow-up to Dark Side of the Moon. In the previous year, they introduced three new pieces to European audiences during the first sets of each show. Two of them, \"Raving and Drooling\" & \"You Gotta Be Crazy\", were ultimately not recorded for Wish You Were Here, but re-shaped and recorded in 1976 for the Animals album as respectively \"Sheep\" and \"Dogs\". The third would take shape as the album's centerpiece, \"Shine on You Crazy Diamond\". During tour rehearsals for the previous year's French Read more on Last.fm.",
      "cover": "https://i.scdn.co/image/ab67616d0000b2731a84d71391df7469c5ab8539"
    },
    {
      "id": 3,
      "name": "Lady Pank",
      "artistId": 4,
      "genre": "Rock",
      "yearOfRelease": 1983,
      "tracks": 10,
      "description": "Opis albumu Lady Pank",
      "cover": "https://i.scdn.co/image/ab67616d0000b2738150be7d67b7b1d8330fa504"
    },
    {
      "id": 4,
      "name": "Animals",
      "artistId": 1,
      "genre": "Prog Rock",
      "yearOfRelease": "1977",
      "tracks": 5,
      "description": "Animals is an album by English progressive rock band Pink Floyd, released on 23 January 1977 in the UK and on 2 February 1977 in the U.S. Animals is a concept album, based on the flaws of capitalism. Various castes in society are represented as different types of animals (Dogs as the businessmen, sheep as the powerless pawns, and pigs as the ruthless leaders). Although this album mainly attacks capitalism, several components are similar to George Orwell's novel \"Animal Farm\": In the book, various animals (mainly pigs, sheep, dogs, etc.) represent different roles assumed by individuals in a communist society. Read more on Last.fm.",
      "cover": "https://i.scdn.co/image/ab67616d0000b273810168d54f85d48f07389237"
    },
    {
      "id": 5,
      "name": "...And Justice for All",
      "artistId": 3,
      "genre": "Thrash Metal",
      "yearOfRelease": "1988",
      "tracks": 147,
      "description": "...And Justice for All is the fourth studio album by American heavy metal band Metallica. Elektra Records released the album on August 25, 1988. This is the first Metallica studio album to feature bassist Jason Newsted, since it is the first after the tragic death of the group's former bassist Cliff Burton. The album's dark subject material, featuring references to nuclear apocalypse, injustice in the law system, limited freedom, war, insanity and hate, is accompanied by the most complex song structures to this date in Metallica's discography. The album is also noted for its near lack of bass guitar and Read more on Last.fm.",
      "cover": "https://i.scdn.co/image/ab67616d0000b273be54746b374358970b5e617a"
    },
    {
      "id": 6,
      "name": "Kinematografia",
      "artistId": 5,
      "genre": "Hip-Hop",
      "yearOfRelease": "2020",
      "tracks": 16,
      "description": "Pierwszy album Paktofoniki",
      "cover": "https://i.scdn.co/image/ab67616d0000b2731735e8581e68c112e7100235"
    },
    {
      "id": 7,
      "name": "Rust in Peace",
      "artistId": 6,
      "genre": "Thrash Metal",
      "yearOfRelease": "1990",
      "tracks": 13,
      "description": "Rust in Peace is the fourth studio album by American thrash metal band Megadeth. It was released by Capitol Records in 1990. A remixed and remastered version, featuring several bonus tracks, was released in 2004. Singles featured on the album include \"Holy Wars...The Punishment Due\", and \"Hangar 18\", both of which were made into music videos. This was the first Megadeth album to feature Marty Friedman and Nick Menza. Production After being released from a twelve-step program, Megadeth frontman Dave Mustaine had hired drummer Nick Menza and guitarist Marty Friedman to record Rust in Peace, creating what would become the Read more on Last.fm.",
      "cover": "https://i.scdn.co/image/ab67616d0000b273be9fa5a89479b6af481938a0"
    },
    {
      "id": 8,
      "name": "Tacy Sami",
      "artistId": 4,
      "genre": "Rock",
      "yearOfRelease": "2007",
      "tracks": 10,
      "description": "Tacy Sami opis albumu",
      "cover": "https://i.scdn.co/image/ab67616d0000b273ab760f366ab654f8ea5f02d9"
    },
    {
      "id": 9,
      "name": "Graduation",
      "artistId": 7,
      "genre": "Hip-Hop",
      "yearOfRelease": "2007",
      "tracks": 13,
      "description": "Graduation is the third studio album by American rapper and producer Kanye West, released on September 11, 2007, through Def Jam Recordings and Roc-A-Fella Records. Recording sessions took place between 2005 and 2007 at several studios in New York and Los Angeles. It was primarily produced by West himself, with contributions from various other producers. The album also features guest appearances from recording artists such as Dwele, T-Pain, Lil Wayne, DJ Premier, and Chris Martin of Coldplay. The cover art and its interior artwork were designed by Japanese contemporary artist Takashi Murakami. Inspired by stadium tours, house-music and indie rock, Read more on Last.fm.",
      "cover": "https://i.scdn.co/image/ab67616d0000b2739bbd79106e510d13a9a5ec33"
    },
    {
      "id": 10,
      "name": "Nawiasem Mówiąc",
      "artistId": 9,
      "genre": "Hip-Hop",
      "yearOfRelease": "2016",
      "tracks": 14,
      "description": "Opis albumu lalalalalalal",
      "cover": "https://i.scdn.co/image/ab67616d0000b2730db5e582a4083ce93e7df6e1"
    }
  ]
}